Revit 2027 API
ParameterTypeId.StairsDesiredNumberOfRisers Property
 "Desired Number of Risers": The number of risers is calculated based on stairs height
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsDesiredNumberOfRisers { get; }
Public Shared ReadOnly Property StairsDesiredNumberOfRisers As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsDesiredNumberOfRisers {
	ForgeTypeId^ get ();
}
static member StairsDesiredNumberOfRisers : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace